<a href="https://colab.research.google.com/github/mayankjain281/SQL_in_Python_Google_Colab/blob/main/SQL_on_Google_Colab.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# In case you are importing file from Drive
from google.colab import drive
drive.mount('/content/drive')

In [ ]:
# In case you are importing file form Desktop
from sqlalchemy import create_engine
my_conn = create_engine("sqlite://///content/my_db.db")

In [ ]:
r_set=my_conn.execute('''SELECT * from student''');
for row in r_set:
    print(row)

(1, 'John Deo', 'Four', 75, 'female')
(2, 'Max Ruin', 'Three', 85, 'male')
(3, 'Arnold', 'Three', 55, 'male')
(4, 'Krish Star', 'Four', 60, 'female')
(5, 'John Mike', 'Four', 60, 'female')
(6, 'Alex John', 'Four', 55, 'male')
(7, 'My John Rob', 'Five', 78, 'male')
(8, 'Asruid', 'Five', 85, 'male')
(9, 'Tes Qry', 'Six', 78, 'male')
(10, 'Big John', 'Four', 55, 'female')
(11, 'Ronald', 'Six', 89, 'female')
(12, 'Recky', 'Six', 94, 'female')
(13, 'Kty', 'Seven', 88, 'female')
(14, 'Bigy', 'Seven', 88, 'female')
(15, 'Tade Row', 'Four', 88, 'male')
(16, 'Gimmy', 'Four', 88, 'male')
(17, 'Tumyu', 'Six', 54, 'male')
(18, 'Honny', 'Five', 75, 'male')
(19, 'Tinny', 'Nine', 18, 'male')
(20, 'Jackly', 'Nine', 65, 'female')
(21, 'Babby John', 'Four', 69, 'female')
(22, 'Reggid', 'Seven', 55, 'female')
(23, 'Herod', 'Eight', 79, 'male')
(24, 'Tiddy Now', 'Seven', 78, 'male')
(25, 'Giff Tow', 'Seven', 88, 'male')
(26, 'Crelea', 'Seven', 79, 'male')
(27, 'Big Nose', 'Three', 81, 'female')
(28, 'Rojj Base', 'Seven', 86, 'female')
(29, 'Tess Played', 'Seven', 55, 'male')
(30, 'Reppy Red', 'Six', 79, 'female')
(31, 'Marry Toeey', 'Four', 88, 'male')
(32, 'Binn Rott', 'Seven', 90, 'female')
(33, 'Kenn Rein', 'Six', 96, 'female')
(34, 'Gain Toe', 'Seven', 69, 'male')
(35, 'Rows Noump', 'Six', 88, 'female')

<ipython-input-2-a32e416b215f>:1: RemovedIn20Warning: Deprecated API features detected! These feature(s) are not compatible with SQLAlchemy 2.0. To prevent incompatible upgrades prior to updating applications, ensure requirements files are pinned to "sqlalchemy<2.0". Set environment variable SQLALCHEMY_WARN_20=1 to show all deprecation warnings.  Set environment variable SQLALCHEMY_SILENCE_UBER_WARNING=1 to silence this message. (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  r_set=my_conn.execute('''SELECT * from student''');

In [ ]:
# display all records of perticular class only
q="SELECT id, name, class, mark, sex FROM student WHERE class='Four'"
my_cursor=my_conn.execute(q)
for row in my_cursor:
  print(row)

(1, 'John Deo', 'Four', 75, 'female')
(4, 'Krish Star', 'Four', 60, 'female')
(5, 'John Mike', 'Four', 60, 'female')
(6, 'Alex John', 'Four', 55, 'male')
(10, 'Big John', 'Four', 55, 'female')
(15, 'Tade Row', 'Four', 88, 'male')
(16, 'Gimmy', 'Four', 88, 'male')
(21, 'Babby John', 'Four', 69, 'female')
(31, 'Marry Toeey', 'Four', 88, 'male')

In [ ]:
# select records based on a perticular class
# display returned data type and Number of records
q="SELECT id, name, class, mark, sex FROM student WHERE class='Four' "
my_cursor=my_conn.execute(q)
data_row=my_cursor.fetchall()
print(type(data_row))
print("No of records : ",len(data_row))

<class 'list'>
No of records :  9

In [ ]:
# select record based on Id
q="SELECT id, name, class, mark, sex FROM student WHERE id=8 "
my_cursor=my_conn.execute(q)
data_row=my_cursor.fetchone()
#print(type(data_row))
print(data_row[0],data_row[1],data_row[3])

8 Asruid 85

In [ ]:
# Show 10 records only
q="SELECT id, name, class, mark, sex FROM student limit 0,10 "
my_cursor=my_conn.execute(q)
data_row=my_cursor.fetchall()
print(type(data_row))
print("No of records : ",len(data_row))
for row in data_row:
  print(row)

<class 'list'>
No of records :  10
(1, 'John Deo', 'Four', 75, 'female')
(2, 'Max Ruin', 'Three', 85, 'male')
(3, 'Arnold', 'Three', 55, 'male')
(4, 'Krish Star', 'Four', 60, 'female')
(5, 'John Mike', 'Four', 60, 'female')
(6, 'Alex John', 'Four', 55, 'male')
(7, 'My John Rob', 'Five', 78, 'male')
(8, 'Asruid', 'Five', 85, 'male')
(9, 'Tes Qry', 'Six', 78, 'male')
(10, 'Big John', 'Four', 55, 'female')

In [ ]:
# printing records using WHERE query, parameterized query
my_data=('Four',)
q="SELECT id, name, class, mark, sex FROM student WHERE class=?"
my_cursor=my_conn.execute(q,my_data)
data_row=my_cursor.fetchall()
for row in data_row:
  print(row)

(1, 'John Deo', 'Four', 75, 'female')
(4, 'Krish Star', 'Four', 60, 'female')
(5, 'John Mike', 'Four', 60, 'female')
(6, 'Alex John', 'Four', 55, 'male')
(10, 'Big John', 'Four', 55, 'female')
(15, 'Tade Row', 'Four', 88, 'male')
(16, 'Gimmy', 'Four', 88, 'male')
(21, 'Babby John', 'Four', 69, 'female')
(31, 'Marry Toeey', 'Four', 88, 'male')

In [ ]:
# printing records using WHERE condition, parameterized query
my_data=('Four','Three')
q="SELECT id, name, class, mark, sex FROM student WHERE class=? OR class=?"
my_cursor=my_conn.execute(q,my_data)
data_row=my_cursor.fetchall()
for row in data_row:
  print(row)

(1, 'John Deo', 'Four', 75, 'female')
(2, 'Max Ruin', 'Three', 85, 'male')
(3, 'Arnold', 'Three', 55, 'male')
(4, 'Krish Star', 'Four', 60, 'female')
(5, 'John Mike', 'Four', 60, 'female')
(6, 'Alex John', 'Four', 55, 'male')
(10, 'Big John', 'Four', 55, 'female')
(15, 'Tade Row', 'Four', 88, 'male')
(16, 'Gimmy', 'Four', 88, 'male')
(21, 'Babby John', 'Four', 69, 'female')
(27, 'Big Nose', 'Three', 81, 'female')
(31, 'Marry Toeey', 'Four', 88, 'male')

In [ ]:
# getting record by using id 
my_data=(8)
q="SELECT id, name, class, mark, sex FROM student WHERE id=?"
my_cursor=my_conn.execute(q,my_data)
data_row=my_cursor.fetchall()
for row in data_row:
  print(row)

(8, 'Asruid', 'Five', 85, 'male')

In [ ]:
# records of class four and mark more than or equal to 80
my_data=('Four',80)
q="SELECT id, name, class, mark, sex FROM student WHERE class=? and mark >= ? "
my_cursor=my_conn.execute(q,my_data)
data_row=my_cursor.fetchall()
for row in data_row:
  print(row)

(15, 'Tade Row', 'Four', 88, 'male')
(16, 'Gimmy', 'Four', 88, 'male')
(31, 'Marry Toeey', 'Four', 88, 'male')

In [ ]:
# asking user input as id to display the record
id=input("Enter the student id : ")
my_data=(id)
q="SELECT id, name, class, mark, sex FROM student WHERE id=?"
my_cursor=my_conn.execute(q,my_data)
data_row=my_cursor.fetchall()
if(len(data_row)==0):
  print("No record found")
else:
  for row in data_row:
    print(row)

Enter the student id : 31
(31, 'Marry Toeey', 'Four', 88, 'male')

In [ ]:
# getting the id of the inserted record
my_data=(None,'Fifth Name','Five',75,'male')
my_query="INSERT INTO student values(?,?,?,?,?) "
result=my_conn.execute(my_query,my_data)
print(result.lastrowid)

36

In [ ]:
# adding multiple records  to student table,
# this is a list with each record as tuple
my_data=[(None, 'Big John', 'Four', 55, 'female'),
(None, 'Ronald', 'Six', 89, 'female'),
(None, 'ONe more', 'Six', 89, 'female')]

my_query="INSERT INTO student values(?,?,?,?,?) "
result=my_conn.execute(my_query,my_data)
print(result.lastrowid)
print(result.rowcount)

None
3

In [ ]:
# Delete sample table student
from sqlalchemy.exc import SQLAlchemyError
try:
  my_conn.execute('''DROP table student;''')
  print("student table deleted")
except SQLAlchemyError as e:
  #print(e)
  error = str(e.__dict__['orig'])
  print(error)

student table deleted

In [ ]:
# creating student table 
from sqlalchemy.exc import SQLAlchemyError
try:
    my_conn.execute('''
        CREATE TABLE IF NOT EXISTS student(id integer primary key, 
                      name text, 
                      class text, 
                      mark integer, 
                      sex text 
                      );''')
    
    print("Student Table created successfully")
except SQLAlchemyError as e:
  #print(e)
  error = str(e.__dict__['orig'])
  print(error)

Student Table created successfully

In [ ]:
#  add records to student table
r_set=my_conn.execute('''INSERT INTO `student` 
(`id`, `name`, `class`, `mark`, `sex`) VALUES
(1, 'John Deo', 'Four', 75, 'female'),
(2, 'Max Ruin', 'Three', 85, 'male'),
(3, 'Arnold', 'Three', 55, 'male'),
(4, 'Krish Star', 'Four', 60, 'female'),
(5, 'John Mike', 'Four', 60, 'female'),
(6, 'Alex John', 'Four', 55, 'male'),
(7, 'My John Rob', 'Five', 78, 'male'),
(8, 'Asruid', 'Five', 85, 'male'),
(9, 'Tes Qry', 'Six', 78, 'male'),
(10, 'Big John', 'Four', 55, 'female'),
(11, 'Ronald', 'Six', 89, 'female'),
(12, 'Recky', 'Six', 94, 'female'),
(13, 'Kty', 'Seven', 88, 'female'),
(14, 'Bigy', 'Seven', 88, 'female'),
(15, 'Tade Row', 'Four', 88, 'male'),
(16, 'Gimmy', 'Four', 88, 'male'),
(17, 'Tumyu', 'Six', 54, 'male'),
(18, 'Honny', 'Five', 75, 'male'),
(19, 'Tinny', 'Nine', 18, 'male'),
(20, 'Jackly', 'Nine', 65, 'female'),
(21, 'Babby John', 'Four', 69, 'female'),
(22, 'Reggid', 'Seven', 55, 'female'),
(23, 'Herod', 'Eight', 79, 'male'),
(24, 'Tiddy Now', 'Seven', 78, 'male'),
(25, 'Giff Tow', 'Seven', 88, 'male'),
(26, 'Crelea', 'Seven', 79, 'male'),
(27, 'Big Nose', 'Three', 81, 'female'),
(28, 'Rojj Base', 'Seven', 86, 'female'),
(29, 'Tess Played', 'Seven', 55, 'male'),
(30, 'Reppy Red', 'Six', 79, 'female'),
(31, 'Marry Toeey', 'Four', 88, 'male'),
(32, 'Binn Rott', 'Seven', 90, 'female'),
(33, 'Kenn Rein', 'Six', 96, 'female'),
(34, 'Gain Toe', 'Seven', 69, 'male'),
(35, 'Rows Noump', 'Six', 88, 'female');''')

###Delete

In [ ]:
# To delete table
from sqlalchemy.exc import SQLAlchemyError
try:
  my_conn.execute(''' DROP table student ''')
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print('Student table is deleted')
finally:
  my_conn.dispose()

In [ ]:
# To delete record
from sqlalchemy.exc import SQLAlchemyError
q="DELETE FROM student WHERE id=5"
try:
  r_set=my_conn.execute(q)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records deleted : ",r_set.rowcount)

In [ ]:
# To delete record by conditions
from sqlalchemy.exc import SQLAlchemyError
my_data=("Five",)
q="DELETE FROM student WHERE class=?"
try:
  r_set=my_conn.execute(q,my_data)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records deleted : ",r_set.rowcount)

In [ ]:
# To delete record by conditions
from sqlalchemy.exc import SQLAlchemyError
my_data=("Six","Seven")
q="DELETE FROM student WHERE class=? OR class=? "
try:
  r_set=my_conn.execute(q,my_data)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records deleted : ",r_set.rowcount)

In [ ]:
# Removing all records. SQLite does not support TRUNCATE command.
from sqlalchemy.exc import SQLAlchemyError
q="DELETE FROM student"
try:
  r_set=my_conn.execute(q)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records deleted : ",r_set.rowcount)

###Distinct

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT DISTINCT(class)  FROM student"
try:
  r_set=my_conn.execute(q)
  data=r_set.fetchall()
  for row in data:
    print(row[0])
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records displayed : ",len(data))

Four
Three
Five
Six
Seven
Nine
Eight
No of records displayed :  7

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT DISTINCT(class)  FROM student WHERE mark>=80"
try:
  r_set=my_conn.execute(q)
  data=r_set.fetchall()
  for row in data:
    print(row[0])
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records displayed : ",len(data))

Three
Five
Six
Seven
Four
No of records displayed :  5

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT DISTINCT(class)  FROM student order by class"
try:
  r_set=my_conn.execute(q)
  data=r_set.fetchall()
  for row in data:
    print(row[0])
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records displayed : ",len(data))

Eight
Five
Four
Nine
Seven
Six
Three
No of records displayed :  7

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT DISTINCT class,sex  FROM student order by class"
try:
  r_set=my_conn.execute(q)
  data=r_set.fetchall()
  for row in data:
    print(row[0],row[1])
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records displayed : ",len(data))

Eight male
Five male
Four female
Four male
Nine male
Nine female
Seven female
Seven male
Six male
Six female
Three male
Three female
No of records displayed :  12

###Update

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
q="UPDATE student SET mark=mark+1"
try:
  r_set=my_conn.execute(q)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records updated : ",r_set.rowcount)

No of records updated :  35

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
q="UPDATE student SET mark=mark+1 WHERE id=7"
try:
  r_set=my_conn.execute(q)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records updated : ",r_set.rowcount)

No of records updated :  1

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
q="UPDATE student SET mark=mark+1 WHERE class='Four'"
try:
  r_set=my_conn.execute(q)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records updated : ",r_set.rowcount)

No of records updated :  9

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
q="UPDATE student SET class='Four' WHERE class='Three'"
try:
  r_set=my_conn.execute(q)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records updated : ",r_set.rowcount)

No of records updated :  3

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
id=input("Enter student id : ")
my_data=(id,)
q="UPDATE student SET mark=mark+5 WHERE id=?"
try:
  r_set=my_conn.execute(q,my_data)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records updated : ",r_set.rowcount)

Enter student id : 11
No of records updated :  1

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
my_data=('Six','Seven')
q="UPDATE student SET class=? WHERE class=?"
try:
  r_set=my_conn.execute(q,my_data)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records updated : ",r_set.rowcount)

No of records updated :  10

###Insert

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
q="INSERT INTO student VALUES(null,'First Name','Four',50,'Male')"
try:
  r_set=my_conn.execute(q)  
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("Number of rows added: ",r_set.rowcount) 
  print("ID of the last inserted row : ",r_set.lastrowid)

Number of rows added:  1
ID of the last inserted row :  36

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
my_data=(None,'Second Name','Four',60,'Female')
q="INSERT INTO student VALUES(?,?,?,?,?)"
try:
  r_set=my_conn.execute(q,my_data)  
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("Number of rows added: ",r_set.rowcount) 
  print("ID of the last inserted row : ",r_set.lastrowid)

Number of rows added:  1
ID of the last inserted row :  37

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
my_data=[(None, 'Tes Qry', 'Six', 78, 'male'),
(None, 'Big John', 'Four', 55, 'female'),
(None, 'Ronald', 'Six', 89, 'female'),
(None, 'Recky', 'Six', 94, 'female'),
(None, 'Kty', 'Seven', 88, 'female')]
q="INSERT INTO student VALUES(?,?,?,?,?)"
try:
  r_set=my_conn.execute(q,my_data)  
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("Number of rows added: ",r_set.rowcount) 
  print("ID of the last inserted row : ",r_set.lastrowid)

Number of rows added:  5
ID of the last inserted row :  None

In [ ]:
q="SELECT * FROM STUDENT order by id desc limit 0,10"
r_set=my_conn.execute(q)
for row in r_set:
  print(row)

(42, 'Kty', 'Seven', 88, 'female')
(41, 'Recky', 'Six', 94, 'female')
(40, 'Ronald', 'Six', 89, 'female')
(39, 'Big John', 'Four', 55, 'female')
(38, 'Tes Qry', 'Six', 78, 'male')
(37, 'Second Name', 'Four', 60, 'Female')
(36, 'First Name', 'Four', 50, 'Male')
(35, 'Rows Noump', 'Six', 89, 'female')
(34, 'Gain Toe', 'Six', 70, 'male')
(33, 'Kenn Rein', 'Six', 97, 'female')

###Between

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT * FROM student WHERE mark BETWEEN 65 AND 75"
try:
  r_set=my_conn.execute(q)  
  r_list=r_set.fetchall()
  for row in r_list:
    print(row)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("Total Number of rows : ",len(r_list))

(20, 'Jackly', 'Nine', 66, 'female')
(21, 'Babby John', 'Four', 71, 'female')
(34, 'Gain Toe', 'Six', 70, 'male')
Total Number of rows :  3

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
my_tuple=(65,75)
q="SELECT * FROM student WHERE mark BETWEEN ? AND ?"
try:
  r_set=my_conn.execute(q,my_tuple)  
  r_list=r_set.fetchall()
  for row in r_list:
    print(row)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("Total Number of rows : ",len(r_list))

(20, 'Jackly', 'Nine', 66, 'female')
(21, 'Babby John', 'Four', 71, 'female')
(34, 'Gain Toe', 'Six', 70, 'male')
Total Number of rows :  3

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
my_tuple=(25,90)
q="SELECT * FROM student WHERE mark NOT BETWEEN ? AND ?"
try:
  r_set=my_conn.execute(q,my_tuple)  
  r_list=r_set.fetchall()
  for row in r_list:
    print(row)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("Total Number of rows : ",len(r_list))

(11, 'Ronald', 'Six', 95, 'female')
(12, 'Recky', 'Six', 95, 'female')
(19, 'Tinny', 'Nine', 19, 'male')
(32, 'Binn Rott', 'Six', 91, 'female')
(33, 'Kenn Rein', 'Six', 97, 'female')
(41, 'Recky', 'Six', 94, 'female')
Total Number of rows :  6

###Order By

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT * FROM student WHERE class='Five' ORDER BY mark DESC"
try:
  r_set=my_conn.execute(q)  
  r_list=r_set.fetchall()
  for rows in r_list:
    print(rows)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("Total Number of rows : ",len(r_list))

(8, 'Asruid', 'Five', 86, 'male')
(7, 'My John Rob', 'Five', 80, 'male')
(18, 'Honny', 'Five', 76, 'male')
Total Number of rows :  3

In [ ]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT * FROM student WHERE class='Five' ORDER BY mark DESC LIMIT 1,1"
try:
  r_set=my_conn.execute(q)  
  r_list=r_set.fetchall()
  for rows in r_list:
    print(rows)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("Total Number of rows : ",len(r_list))

(7, 'My John Rob', 'Five', 80, 'male')
Total Number of rows :  1

### Reference

Download database

https://www.plus2net.com/python/sqlite-colab.php


List of Python SQLite tutorial videos

https://www.plus2net.com/python/python-sqlite-video.php

https://www.plus2net.com/python/sqlite.php

https://www.youtube.com/playlist?list=PLzz7R3Slbh5TI4RVHqapk3PUBmoW5JE_z

https://www.plus2net.com/python/sqlite-delete-sqlalchemy.php

https://www.plus2net.com/python/sqlite-distinct.php

https://www.plus2net.com/python/sqlite-update.php

https://www.plus2net.com/python/sqlite-insert-sqlalchemy.php

https://www.plus2net.com/python/sqlite-between.php

Creating Database

https://www.plus2net.com/python/sqlite.php

https://www.plus2net.com/python/sqlite-connection.php#data_student

https://github.com/kiranbeethoju/TeachingMachine/blob/master/SQLite3_Novice.ipynb

In [45]:
import sqlite3
my_conn = sqlite3.connect('new_db')
print("Created database successfully");

Created database successfully

In [46]:
my_conn.execute('''
CREATE TABLE IF NOT EXISTS Lerners(id integer primary key, 
                      name text, 
                      class text, 
                      mark integer, 
                      gender text 
                      );''')
my_conn.commit()
print("Lerners Table created successfully");

Lerners Table created successfully

In [47]:
r_set=my_conn.execute('''PRAGMA table_info(Lerners);''')
for row in r_set:
    print(row)

(0, 'id', 'integer', 0, None, 1)
(1, 'name', 'text', 0, None, 0)
(2, 'class', 'text', 0, None, 0)
(3, 'mark', 'integer', 0, None, 0)
(4, 'gender', 'text', 0, None, 0)

In [48]:
l1=my_conn.execute("PRAGMA table_info(Lerners);")
columns=[r[1] for r in l1] # list of column headers of the table

In [49]:
r_set=my_conn.execute(
    '''INSERT INTO `Lerners` 
  (`id`, `name`, `class`, `mark`, `gender`) VALUES
  (1, 'John Deo', 'Four', 75, 'female'),
  (2, 'Max Ruin', 'Three', 85, 'male'),
  (3, 'Arnold', 'Three', 55, 'male'),
  (4, 'Krish Star', 'Four', 60, 'female'),
  (5, 'John Mike', 'Four', 60, 'female'),
  (6, 'Alex John', 'Four', 55, 'male'),
  (7, 'My John Rob', 'Five', 78, 'male'),
  (8, 'Asruid', 'Five', 85, 'male'),
  (9, 'Tes Qry', 'Six', 78, 'male'),
  (10, 'Big John', 'Four', 55, 'female'),
  (11, 'Ronald', 'Six', 89, 'female'),
  (12, 'Recky', 'Six', 94, 'female'),
  (13, 'Kty', 'Seven', 88, 'female'),
  (14, 'Bigy', 'Seven', 88, 'female'),
  (15, 'Tade Row', 'Four', 88, 'male'),
  (16, 'Gimmy', 'Four', 88, 'male'),
  (17, 'Tumyu', 'Six', 54, 'male'),
  (18, 'Honny', 'Five', 75, 'male'),
  (19, 'Tinny', 'Nine', 18, 'male'),
  (20, 'Jackly', 'Nine', 65, 'female'),
  (21, 'Babby John', 'Four', 69, 'female'),
  (22, 'Reggid', 'Seven', 55, 'female'),
  (23, 'Herod', 'Eight', 79, 'male'),
  (24, 'Tiddy Now', 'Seven', 78, 'male'),
  (25, 'Giff Tow', 'Seven', 88, 'male'),
  (26, 'Crelea', 'Seven', 79, 'male'),
  (27, 'Big Nose', 'Three', 81, 'female'),
  (28, 'Rojj Base', 'Seven', 86, 'female'),
  (29, 'Tess Played', 'Seven', 55, 'male'),
  (30, 'Reppy Red', 'Six', 79, 'female'),
  (31, 'Marry Toeey', 'Four', 88, 'male'),
  (32, 'Binn Rott', 'Seven', 90, 'female'),
  (33, 'Kenn Rein', 'Six', 96, 'female'),
  (34, 'Gain Toe', 'Seven', 69, 'male'),
  (35, 'Rows Noump', 'Six', 88, 'female');''')

In [52]:
r_set=my_conn.execute('''SELECT * from Lerners LIMIT 2''');
for row in r_set:
    print(row)

(1, 'John Deo', 'Four', 75, 'female')
(2, 'Max Ruin', 'Three', 85, 'male')

In [51]:
import pandas as pd
qry = """

SELECT * FROM Lerners

"""
df = pd.read_sql_query(qry, my_conn)
df.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

https://towardsdatascience.com/have-a-sql-interview-coming-up-ace-it-using-google-colab-6d3c0ffb29dc

https://cloud.google.com/bigquery/docs/explore-data-colab